In [1]:
import pandas as pd

In [2]:
train = pd.read_csv("data/train.csv")

In [52]:
test = pd.read_csv("data/test.csv")

In [4]:
type(train)

pandas.core.frame.DataFrame

In [15]:
train.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Title
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S,Mr
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C,Mrs
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S,Miss
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S,Mrs
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S,Mr

In [6]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [7]:
train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [8]:
train.describe(include=["O"])

,Name,Sex,Ticket,Cabin,Embarked
count,891,891,891,204,889
unique,891,2,681,147,3
top,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",male,CA. 2343,C23 C25 C27,S
freq,1,577,7,4,644

In [10]:
train = train.drop(['Ticket','Cabin','PassengerId'], axis=1)

In [54]:
test = test.drop(['Ticket','Cabin'], axis=1)

In [14]:
train['Title'] = train.Name.str.extract('(\w+)\.', expand=False)

In [56]:
test['Title'] = test.Name.str.extract('(\w+)\.', expand=False)

In [20]:
pd.crosstab(train['Title'], train['Sex'])

Sex       female  male
Title
Countess       1     0
Master         0    40
Miss         185     0
Mr             0   517
Mrs          126     0
Rare           2    20

In [19]:
train['Title'] = train['Title'].replace(['Lady','Countress','Capt','Col','Don','Dr','Jonkheer','Major','Rev','Sir','Dona'],'Rare')
train['Title'] = train['Title'].replace(['Mlle','Ms'], "Miss")
train['Title'] = train['Title'].replace('Mme','Mrs')

In [57]:
test['Title'] = test['Title'].replace(['Lady','Countress','Capt','Col','Don','Dr','Jonkheer','Major','Rev','Sir','Dona'],'Rare')
test['Title'] = test['Title'].replace(['Mlle','Ms'], "Miss")
test['Title'] = test['Title'].replace('Mme','Mrs')

In [58]:
train = train.drop(['Name'], axis=1)
test = test.drop(['Name'], axis=1)

In [28]:
freq_port = train.Embarked.dropna().mode()[0]
train['Embarked'] = train['Embarked'].fillna(freq_port)

In [59]:
freq_port = train.Embarked.dropna().mode()[0]
train['Embarked'] = train['Embarked'].fillna(freq_port)
test ['Embarked'] = test['Embarked'].fillna(freq_port)

In [60]:
median_age = train.Age.dropna().median()
median_fare = train.Fare.dropna().median()
train['Age'] = train['Age'].fillna(median_age)
test['Age'] = train['Age'].fillna(median_age)

train['Fare'] = train['Fare'].fillna(median_age)
test['Fare'] = train['Fare'].fillna(median_age)

In [32]:
train.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked Title
0         0       3    male  22.0      1      0   7.2500        S    Mr
1         1       1  female  38.0      1      0  71.2833        C   Mrs
2         1       3  female  26.0      0      0   7.9250        S  Miss
3         1       1  female  35.0      1      0  53.1000        S   Mrs
4         0       3    male  35.0      0      0   8.0500        S    Mr

In [35]:
from sklearn.preprocessing import LabelEncoder

In [61]:
le = LabelEncoder()
train['Sex'] = le.fit_transform(train['Sex'])
train['Title'] = le.fit_transform(train['Title'])
train['Embarked'] = le.fit_transform(train['Embarked'])

test['Sex'] = le.fit_transform(test['Sex'])
test['Title'] = le.fit_transform(test['Title'])
test['Embarked'] = le.fit_transform(test['Embarked'])

In [62]:
test.head()

   PassengerId  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked  Title
0          892       3    1  22.0      0      0   7.2500         1      2
1          893       3    0  38.0      1      0  71.2833         2      3
2          894       2    1  26.0      0      0   7.9250         1      2
3          895       3    1  35.0      0      0  53.1000         2      2
4          896       3    0  35.0      1      1   8.0500         2      3

In [63]:
from sklearn.model_selection import train_test_split

X_train = train.drop("Survived", axis=1)
y_train = train["Survived"]
X_test = test.drop ("PassengerId", axis=1).copy()

X_train, X_val, y_train, y_val = train_test_split(X_train, y_train, test_size=0.2, random_state = 1)

In [43]:
from sklearn.neighbors import KNeighborsClassifier

knn = KNeighborsClassifier(n_neighbors = 5)
knn.fit(X_train, y_train)
acc_knn = knn.score(X_val, y_val)
print(acc_knn)

0.6871508379888268

In [44]:
from sklearn.tree import DecisionTreeClassifier

#Instancier l'algo
decision_tree = DecisionTreeClassifier(max_depth = 5)
#Entrainer sur l'ensemble de train
decision_tree.fit(X_train, y_train)

acc_decision_tree = decision_tree.score(X_val, y_val)
print(acc_decision_tree)

0.7821229050279329

In [64]:
y_pred = decision_tree.predict(X_test)
y_pred

array([1, 0, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       0, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 0,
       1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0,
       0, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 1, 1, 0,
       0, 1, 1, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0,
       1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0,
       1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1,
       1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1,
       1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1,
       1, 1, 0, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1,
       1, 1, 0, 1, 1, 0, 1, 1, 0, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 0, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0, 1, 1, 1, 1, 1])

In [67]:
submission = pd.DataFrame({
    "PassengerId": test['PassengerId'],
    "Survived": y_pred
})

In [68]:
submission.head()

   PassengerId  Survived
0          892         1
1          893         0
2          894         1
3          895         1
4          896         0

In [69]:
submission.to_csv('output/submission_1.csv', index=False)

In [72]:
from toolbox import submit
final_score = submit('output/submission_1.csv')

Votre accuracy score est de 0.39712918660287083.
Heeu comment dire... Essai à nouveau, ce n'est pas terrible 👎